### Стадии тестирования и разработки софта

#### Если не углубляться в нюансы разработки и тестирования, то обычно говорят о пяти состояниях, в которых находится программа:
#### Преальфа (Pre-alpha) — самая начальная стадия разработки.
#### Альфа-версия — вроде всё сделали, протестировали самое основное.
#### Бета-версия — оттестировали большую часть, ловим тараканов при поддержке небольшого круга доверенных людей.
#### Релиз-кандидат — почти готовая к выпуску программа.
#### Релиз — готовая программа.  
